#### Terraform Plan 📖 ####
<details><summary>Show Plan</summary>

```terraform
tailscale_tailnet_key.main: Refreshing state... [id=kANHoGieHD11CNTRL]
data.cloudflare_ip_ranges.main: Reading...
data.cloudflare_account.main: Reading...
data.cloudflare_ip_ranges.main: Read complete after 0s
data.oci_identity_availability_domains.main: Reading...
data.oci_containerengine_cluster_option.main: Reading...
oci_identity_compartment.main: Refreshing state... [id=ocid1.compartment.oc1..aaaaaaaaxks7l2gcjjk3euzod7mzd22vc6bmczuqtto3f6z3aamcglgy2ujq]
oci_identity_group.managers: Refreshing state... [id=ocid1.group.oc1..aaaaaaaac7alsg5sta36d66mr4yflfdakygdxxusvnv54km3nznudlyvbaba]
data.oci_core_services.all_services: Reading...
oci_objectstorage_bucket.state: Refreshing state... [id=n/cnm7patunz1z/b/platform-state]
oci_identity_user.manager: Refreshing state... [id=ocid1.user.oc1..aaaaaaaafxpfydig3om5bsydxijntrc64fbbjalgrjybqq6i2eihpjkxpzta]
oci_budget_budget.main: Refreshing state... [id=ocid1.budget.oc1.ap-seoul-1.amaaaaaabsyhd7qa2wpumdq7peealllchr7ao5lcpkldzdgzgq7qoij4x2yq]
oci_identity_policy.cluster: Refreshing state... [id=ocid1.policy.oc1..aaaaaaaagu6nbrnawfhjdwnrkfbzn6smo345m22gzfl55qxvxt7vep4yfqeq]
data.oci_core_images.ubuntu: Reading...
data.oci_identity_availability_domains.main: Read complete after 1s [id=IdentityAvailabilityDomainsDataSource-686890930]
oci_logging_log_group.main: Refreshing state... [id=ocid1.loggroup.oc1.ap-seoul-1.amaaaaaabsyhd7qaqvtgvi64v26joo3vxbfpml4csr72nwk5cirrxqpjotda]
data.oci_core_services.all_services: Read complete after 1s [id=CoreServicesDataSource-0]
oci_artifacts_container_repository.application: Refreshing state... [id=ocid1.containerrepo.oc1.ap-seoul-1.0.cnm7patunz1z.aaaaaaaa7rlpcolbbhe2tqr3r4tokxl4wizslzh4pryinxffib4wdq3mzhma]
data.oci_containerengine_cluster_option.main: Read complete after 1s [id=ContainerengineClusterOptionDataSource-1870923232]
oci_ons_notification_topic.main: Refreshing state... [id=ocid1.onstopic.oc1.ap-seoul-1.amaaaaaabsyhd7qaitbrw7kzaoyqmbd5ld4hrjt6wss4fexrwgz4qngcknga]
oci_core_public_ip.main: Refreshing state... [id=ocid1.publicip.oc1.ap-seoul-1.amaaaaaabsyhd7qafbingjhb7nxqn3qcaowsc7sgyi2trscfa6jzlhu7wvmq]
data.cloudflare_account.main: Read complete after 1s [id=ec0cbb953bed382efecdedb2fadea7c4]
oci_core_vcn.main: Refreshing state... [id=ocid1.vcn.oc1.ap-seoul-1.amaaaaaabsyhd7qazvdwifpfgn75iw5yxheajr5ng4esmlikj23v7ee2ef3q]
data.oci_identity_fault_domains.main: Reading...
oci_budget_alert_rule.main: Refreshing state... [id=ocid1.alertrule.oc1.ap-seoul-1.amaaaaaabsyhd7qajb44qwouyva4scc7ygfqdopoxjihlhbakqyetfr2wv2q]
oci_identity_auth_token.application: Refreshing state... [id=ocid1.credential.oc1..aaaaaaaad6ed2wnvwb7pqj6mipgcodcurwrqz35u2elduhntp72r7yemi6ea]
cloudflare_zone.main: Refreshing state... [id=17ad56810b60da50d4fc69f477b6e3fd]
data.oci_core_images.ubuntu: Read complete after 0s [id=CoreImagesDataSource-675692870]
oci_identity_user_group_membership.manager: Refreshing state... [id=ocid1.groupmembership.oc1..aaaaaaaa3mgwk4qef6qpqqgvi7duo7ep6ydxa6ionu4l5gx3vgffqaa3qutq]
data.oci_identity_fault_domains.main: Read complete after 0s [id=IdentityFaultDomainsDataSource-2954258040]
oci_identity_policy.manager: Refreshing state... [id=ocid1.policy.oc1..aaaaaaaayhc5xs4li2w3l32btbgwn5bh6om3lyn2y2qiyvcrsebvbno4e6cq]
cloudflare_zone_setting.tls-version: Refreshing state... [id=min_tls_version]
cloudflare_zone_setting.websocket: Refreshing state... [id=websockets]
cloudflare_zone_setting.ssl-mode: Refreshing state... [id=ssl]
cloudflare_zone_setting.security-level: Refreshing state... [id=security_level]
cloudflare_zone_setting.secure-mode: Refreshing state... [id=always_use_https]
cloudflare_dns_record.dashboard: Refreshing state... [id=b851bc0c9ae7943e8f33c1049634f142]
oci_core_internet_gateway.main: Refreshing state... [id=ocid1.internetgateway.oc1.ap-seoul-1.aaaaaaaaonpjrtiqcayeevrkbiavrrjberaljszeqx3xxucgnczyyn34u4ka]
oci_core_network_security_group.worker: Refreshing state... [id=ocid1.networksecuritygroup.oc1.ap-seoul-1.aaaaaaaaz5y4ozx4tv6f6r3vbymfmwgddettc25rc5w2afrg5libo3o662fq]
oci_core_service_gateway.main: Refreshing state... [id=ocid1.servicegateway.oc1.ap-seoul-1.aaaaaaaa6pdgo7kccqt4r4cs747knrxybmaz2xkcvdaqau6ztjc2rdm3tnba]
oci_core_network_security_group.cluster: Refreshing state... [id=ocid1.networksecuritygroup.oc1.ap-seoul-1.aaaaaaaargvnkigajohw6qvznbzlrdtmivyeaunrlx5dgeqvugie7xywtnea]
oci_core_network_security_group.bastion: Refreshing state... [id=ocid1.networksecuritygroup.oc1.ap-seoul-1.aaaaaaaayquhop5uavha3rpzt4lukx6kdpz6d6wraegzddtzahq4pnlwhzgq]
oci_core_nat_gateway.main: Refreshing state... [id=ocid1.natgateway.oc1.ap-seoul-1.aaaaaaaap7fljb33jz7xfhnm54leup5owryl6xen4fzgkvnjqdz3dtsoupkq]
oci_ons_subscription.email: Refreshing state... [id=ocid1.onssubscription.oc1.ap-seoul-1.aaaaaaaaaarkzfrko5jnvzkbpad3c5fojdswzzu3u47ffxiisu4agl4rqwzq]
oci_monitoring_alarm.instance-memory: Refreshing state... [id=ocid1.alarm.oc1.ap-seoul-1.amaaaaaabsyhd7qas5de7mmyekowv2zsbw2oxqz6pjwpqa5awsttqhtf4o2q]
oci_monitoring_alarm.instance-cpu: Refreshing state... [id=ocid1.alarm.oc1.ap-seoul-1.amaaaaaabsyhd7qa6qx5fjp34nevhtdeneyqhjzt43stjxvzy6jip2gpcs6a]
oci_core_route_table.public: Refreshing state... [id=ocid1.routetable.oc1.ap-seoul-1.aaaaaaaaf4htalzhwrxx4763yptthhd7oxu4schmuv2hq5u32xbi22pygdqq]
oci_core_network_security_group_security_rule.cluster-to-global: Refreshing state... [id=C704C9]
oci_core_network_security_group_security_rule.cluster-from-worker-api: Refreshing state... [id=A3A3FB]
oci_core_network_security_group_security_rule.cluster-from-worker-management: Refreshing state... [id=407CCB]
oci_core_network_security_group_security_rule.cluster-to-worker: Refreshing state... [id=8489A2]
oci_core_network_security_group_security_rule.worker-to-global: Refreshing state... [id=903BB0]
oci_core_network_security_group_security_rule.worker-from-https: Refreshing state... [id=A848B6]
oci_core_network_security_group_security_rule.worker-from-worker: Refreshing state... [id=3CF182]
oci_core_network_security_group_security_rule.worker-icmp: Refreshing state... [id=9C1E3C]
oci_core_network_security_group_security_rule.worker-from-http: Refreshing state... [id=C35C7C]
oci_core_network_security_group_security_rule.worker-from-cluster: Refreshing state... [id=804EE8]
oci_core_network_security_group_security_rule.cluster-from-bastion: Refreshing state... [id=E359DE]
oci_core_network_security_group_security_rule.worker-from-bastion: Refreshing state... [id=DE31C8]
oci_core_network_security_group_security_rule.bastion-to-global: Refreshing state... [id=5B12E3]
oci_core_subnet.public: Refreshing state... [id=ocid1.subnet.oc1.ap-seoul-1.aaaaaaaavvobrlojwajixsampnnqwjpnrwqrp23kp5kfnr3vxqxdluskhafq]
oci_logging_log.subnet-public: Refreshing state... [id=ocid1.log.oc1.ap-seoul-1.amaaaaaabsyhd7qahitcriuodikgvfgjk7qcjpapxg32de6zai6mtuuearca]
oci_core_route_table.private: Refreshing state... [id=ocid1.routetable.oc1.ap-seoul-1.aaaaaaaa2gdnpvg6ecx744a63vowlzaagbsqkmbb7wuf2i5lyyilfaesfpmq]
oci_core_subnet.private: Refreshing state... [id=ocid1.subnet.oc1.ap-seoul-1.aaaaaaaaz2zzw7w2kolrxzxelyfpu2lnsa6oths6txnblyewgc7wf3pr6dqq]
oci_logging_log.subnet-private: Refreshing state... [id=ocid1.log.oc1.ap-seoul-1.amaaaaaabsyhd7qalejvdxip7gkcra4rcyqknkchnfumj4j766annytvv4ba]
tailscale_acl.main: Refreshing state... [id=1b5d5621-19fb-f490-b890-5cba657914cf]
oci_containerengine_cluster.main: Refreshing state... [id=ocid1.cluster.oc1.ap-seoul-1.aaaaaaaav675okbokp7hx5psdy6mt2bstn6zvvgvxvcuipmrvcxsuzj32fmq]
oci_core_instance.bastion: Refreshing state... [id=ocid1.instance.oc1.ap-seoul-1.anuwgljrbsyhd7qcrxmlulolu4tzvap7fgqnkmyhieqcmmbeo6eqktuawniq]
data.oci_containerengine_cluster_kube_config.main: Reading...
data.oci_containerengine_node_pool_option.main: Reading...
data.oci_containerengine_cluster_kube_config.main: Read complete after 0s [id=ContainerengineClusterKubeConfigDataSource-3656204518]
helm_release.metrics: Refreshing state... [id=metrics]
kubernetes_namespace_v1.system: Refreshing state... [id=system]
kubernetes_priority_class_v1.dev: Refreshing state... [id=priority-dev]
kubernetes_priority_class_v1.main: Refreshing state... [id=priority-main]
kubernetes_namespace_v1.dev: Refreshing state... [id=dev]
kubernetes_namespace_v1.main: Refreshing state... [id=main]
kubernetes_priority_class_v1.system: Refreshing state... [id=priority-system]
data.oci_containerengine_node_pool_option.main: Read complete after 0s [id=ContainerengineNodePoolOptionDataSource-3381421671]
oci_containerengine_node_pool.main: Refreshing state... [id=ocid1.nodepool.oc1.ap-seoul-1.aaaaaaaan674whrp5r7gjgbl3g3fvvpyfrnrg523vn3cs7vmtnz7pmrrmlia]
kubernetes_resource_quota_v1.system: Refreshing state... [id=system/quota-system]
kubernetes_resource_quota_v1.main: Refreshing state... [id=main/quota-main]
kubernetes_ingress_v1.dashboard: Refreshing state... [id=system/ingress-dashboard]
kubernetes_limit_range_v1.main: Refreshing state... [id=main/limit-main]
helm_release.dashboard: Refreshing state... [id=dashboard]
kubernetes_limit_range_v1.system: Refreshing state... [id=system/limit-system]
kubernetes_resource_quota_v1.dev: Refreshing state... [id=dev/quota-dev]
helm_release.controller: Refreshing state... [id=controller]
kubernetes_deployment_v1.application-dev: Refreshing state... [id=dev/application-dev]
kubernetes_limit_range_v1.dev: Refreshing state... [id=dev/limit-dev]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place

Terraform will perform the following actions:

  # helm_release.dashboard will be updated in-place
  ~ resource "helm_release" "dashboard" {
      ~ id                         = "dashboard" -> (known after apply)
      ~ metadata                   = {
          ~ app_version    = "ce-latest-ee-2.33.6" -> (known after apply)
          ~ chart          = "portainer" -> (known after apply)
          ~ first_deployed = 1767527946 -> (known after apply)
          ~ last_deployed  = 1767531816 -> (known after apply)
          ~ name           = "dashboard" -> (known after apply)
          ~ namespace      = "system" -> (known after apply)
          ~ notes          = <<-EOT
                Get the application URL by running these commands:
                  export POD_NAME=$(kubectl get pods --namespace system -l "app.kubernetes.io/name=portainer,app.kubernetes.io/instance=dashboard" -o jsonpath="{.items[0].me$  echo "Visit http://127.0.0.1:9443 to use your application"
                  kubectl --namespace system port-forward $POD_NAME 9443:9443
            EOT -> (known after apply)
          ~ revision       = 4 -> (known after apply)
          ~ values         = jsonencode(
                {
                  - extraArgs   = [
                      - "--admin-password",
                      - "$2a$10$R.T5fiAUS0YdZCw9k1.Cu.8yMC2lqRXOQLmqsxrldpBoWPwd3sa.2",
                    ]
                  - image       = {
                      - pullPolicy = "Always"
                      - repository = "docker.io/portainer/portainer-ce"
                      - tag        = "latest"
                    }
                  - persistence = {
                      - enabled = false
                    }
                  - resources   = {
                      - limits   = {
                          - cpu    = "200m"
                          - memory = "256Mi"
                        }
                      - requests = {
                          - cpu    = "100m"
                          - memory = "128Mi"
                        }
                    }
                  - service     = {
                      - type = "ClusterIP"
                    }
                }
            ) -> (known after apply)
          ~ version        = "2.33.6" -> (known after apply)
        } -> (known after apply)
        name                       = "dashboard"
      ~ values                     = [
          ~ jsonencode(
                {
                  - extraArgs   = [
                      - "--admin-password",
                      - "$2a$10$R.T5fiAUS0YdZCw9k1.Cu.8yMC2lqRXOQLmqsxrldpBoWPwd3sa.2",
                    ]
                  - image       = {
                      - pullPolicy = "Always"
                      - repository = "docker.io/portainer/portainer-ce"
                      - tag        = "latest"
                    }
                  - persistence = {
                      - enabled = false
                    }
                  - resources   = {
                      - limits   = {
                          - cpu    = "200m"
                          - memory = "256Mi"
                        }
                      - requests = {
                          - cpu    = "100m"
                          - memory = "128Mi"
                        }
                    }
                  - service     = {
                      - type = "ClusterIP"
                    }
                }
            ) -> (known after apply),
        ]
        # (29 unchanged attributes hidden)
    }

  # kubernetes_ingress_v1.dashboard will be updated in-place
  ~ resource "kubernetes_ingress_v1" "dashboard" {
        id     = "system/ingress-dashboard"
        # (1 unchanged attribute hidden)

      ~ metadata {
          ~ annotations      = {
              + "traefik.ingress.kubernetes.io/router.sticky.cookie"      = "true"
              + "traefik.ingress.kubernetes.io/router.sticky.cookie.name" = "portainer_sticky_session"
                # (3 unchanged elements hidden)
            }
            name             = "ingress-dashboard"
            # (6 unchanged attributes hidden)
        }

        # (1 unchanged block hidden)
    }

Plan: 0 to add, 2 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
Releasing state lock. This may take a few moments...

```

</details>

*Pushed by: @ensia96, Action: `pull_request`*